//1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
//За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.

let str = 'Привіт'
console.log(typeof str)

let num = 123
console.log(typeof num)

let flag = true
console.log(flag)
let txt = "true"
console.log(txt)

//2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//         34,
//         12,
//         66,
//         90,
//         87
// Старайтесь використовувати різні оператори.
//         Example: 88 = (16 / 2) * 11
let a1 = (10 * 3) + 4
console.log(a1)
let a2 = (6 * 4) / 2
console.log(a2)
let a3 = (12 / 2 ) * 11
console.log(a3)
let a4 = (10 + 20) * 3
console.log(a4)
let a5 = (10 * 9) - 3
console.log(a5)
// Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//         5 % 3,
//         3 % 5,
//         5 + '3',
//         '5' - 3,
//         75 + 'кг'

let a6 = 5 % 3
console.log(a6)
let a7 = 3 % 5
console.log(a7)
let a8 = 5 + '3'
console.log(a8)
let a9 = '5' - 3
console.log(a9)
let a10 = 75 + 'кг'
console.log(a10)

// Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значееня площі зберігати в змінній s.
let heigth = 23
let weidth = 10
let s = heigth * weidth
console.log(s)
// Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//         результат поместите в переменную v.
// формула Pr^2h

let heigthC = 10
let dC = 2 ** 2
const p = 3.14
let v = (p * dC) * heigthC
console.log(v)

// У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).

let n = 3
let m = 4
let k = Math.sqrt(Math.pow(n , 2) + Math.pow(m, 2),2)
console.log(k)

// Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).

// alert("Когут Тарас Андрійович\n 21\n Спорт\n")



// Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//         Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//         Вывести в документ содержимое переменной concatenation спомощью document.write

let str1 = 'Хто'
let str2 = 'ти'
let str3 = 'такий'
let concatenation = str1 + ' ' +  str2 + ' ' + str3
document.write(concatenation +"<br/>")

// Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
let strr = '20'
let a = 5
document.write(strr + a + "<br/>")//
document.write(strr - a + "<br/>")
document.write(strr * '2' + "<br/>")
document.write(strr / a + "<br/>")

// С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert

let z = prompt('Ведіть число')
let x = prompt('введіть ще одне число')
let c = z + x
alert(c)


// С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
// Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert

// let q = prompt('Імя')
// let w = prompt('Прізвище')
// let e = prompt('Вік')
// alert(`Доброго вечера ${q}  ${w} , мои поздравления что вам ${e}`)


